# Pandas Practice

This notebook is dedicated to practicing different tasks with pandas. The solutions are available in a solutions notebook, however, you should always try to figure them out yourself first.

It should be noted there may be more than one different way to answer a question or complete an exercise.

Exercises are based off (and directly taken from) the quick introduction to pandas notebook.

Different tasks will be detailed by comments or text.

For further reference and resources, it's advised to check out the [pandas documentation](https://pandas.pydata.org/pandas-docs/stable/).

In [1]:
# Import pandas
import pandas as pd

In [2]:
# Create a series of three different colours
color = pd.Series(['green','blue','pink'])

In [3]:
# View the series of different colours
color

0    green
1     blue
2     pink
dtype: object

In [4]:
# Create a series of three different car types and view it
car = pd.Series(['toyota','honda','suzuki'])
car

0    toyota
1     honda
2    suzuki
dtype: object

In [5]:
# Combine the Series of cars and colours into a DataFrame
color + pd.Series([' ']*3) + car

0    green toyota
1      blue honda
2     pink suzuki
dtype: object

In [6]:
# Import "../data/car-sales.csv" and turn it into a DataFrame

**Note:** Since you've imported `../data/car-sales.csv` as a DataFrame, we'll now refer to this DataFrame as 'the car sales DataFrame'.

In [7]:
# Export the DataFrame you created to a .csv file
car_df = pd.read_csv ("../zero-to-mastery-ml-master/data/car-sales.csv")

In [8]:
# Find the different datatypes of the car data DataFrame
car_df

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [9]:
# Describe your current car sales DataFrame using describe()
x = car_df.describe()

In [10]:
# Get information about your DataFrame using info()
car_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

What does it show you?

In [11]:
# Create a Series of different numbers and find the mean of them
pd.Series([325,595,777]).mean()

565.6666666666666

In [12]:
# Create a Series of different numbers and find the sum of them
pd.Series([95,32,100]).sum()

227

In [13]:
# List out all the column names of the car sales DataFrame
car_df.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [14]:
# Find the length of the car sales DataFrame
car_df.index

RangeIndex(start=0, stop=10, step=1)

In [15]:
# Show the first 5 rows of the car sales DataFrame
car_df.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [16]:
# Show the first 7 rows of the car sales DataFrame
car_df.head(7)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [17]:
# Show the bottom 5 rows of the car sales DataFrame
car_df.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [18]:
# Use .loc to select the row at index 3 of the car sales DataFrame
car_df.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [19]:
# Use .iloc to select the row at position 3 of the car sales DataFrame
car_df.iloc[3:]

     Make Colour  Odometer (KM)  Doors       Price
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

Notice how they're the same? Why do you think this is? 

Check the pandas documentation for [.loc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html) and [.iloc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html). Think about a different situation each could be used for and try them out.

In [20]:
# Select the "Odometer (KM)" column from the car sales DataFrame
car_df['Odometer (KM)']

0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Odometer (KM), dtype: int64

In [21]:
# Find the mean of the "Odometer (KM)" column in the car sales DataFrame
car_df['Odometer (KM)'].mean()

78601.4

In [22]:
# Select the rows with over 100,000 kilometers on the Odometer
car_df[car_df['Odometer (KM)']> 100000]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00

In [23]:
# Create a crosstab of the Make and Doors columns
pd.crosstab(car_df["Doors"],car_df['Make'])

Make   BMW  Honda  Nissan  Toyota
Doors
3        0      0       0       1
4        0      3       2       3
5        1      0       0       0

In [24]:
# Group columns of the car sales DataFrame by the Make column and find the average
car_df.groupby(["Make"]).mean()

        Odometer (KM)  Doors
Make
BMW      11179.000000   5.00
Honda    62778.333333   4.00
Nissan  122347.500000   4.00
Toyota   85451.250000   3.75

In [25]:
# Import Matplotlib and create a plot of the Odometer column
# Don't forget to use %matplotlib inline

In [26]:
# Create a histogram of the Odometer column using hist()

In [27]:
# Try to plot the Price column using plot()

Why didn't it work? Can you think of a solution?

You might want to search for "how to convert a pandas string column to numbers".

And if you're still stuck, check out this [Stack Overflow question and answer on turning a price column into integers](https://stackoverflow.com/questions/44469313/price-column-object-to-int-in-pandas).

See how you can provide the example code there to the problem here.

In [28]:
# Remove the punctuation from price column
car_df.Price = (car_df["Price"].replace(('\$','\,','\.'),'',regex=True)).astype(int)

In [29]:
# Check the changes to the price column
car_df.Price

0     400000
1     500000
2     700000
3    2200000
4     350000
5     450000
6     750000
7     700000
8     625000
9     970000
Name: Price, dtype: int32

In [30]:
# Remove the two extra zeros at the end of the price column
car_df.Price = (car_df.Price/100).astype(int)

In [31]:
# Check the changes to the Price column
car_df.Price

0     4000
1     5000
2     7000
3    22000
4     3500
5     4500
6     7500
7     7000
8     6250
9     9700
Name: Price, dtype: int32

In [32]:
# Change the datatype of the Price column to integers

In [33]:
# Lower the strings of the Make column
car_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     int32
dtypes: int32(1), int64(2), object(2)
memory usage: 488.0+ bytes

If you check the car sales DataFrame, you'll notice the Make column hasn't been lowered.

How could you make these changes permanent?

Try it out.

In [34]:
# Make lowering the case of the Make column permanent
car_df.Make =   car_df.Make.str.lower()

In [35]:
# Check the car sales DataFrame
car_df.Make

0    toyota
1     honda
2    toyota
3       bmw
4    nissan
5    toyota
6     honda
7     honda
8    toyota
9    nissan
Name: Make, dtype: object

Notice how the Make column stays lowered after reassigning.

Now let's deal with missing data.

In [87]:
# Import the car sales DataFrame with missing data ("../data/car-sales-missing-data.csv")
car_sal_miss_df = pd.read_csv('../zero-to-mastery-ml-master/data/car-sales-missing-data.csv')

# Check out the new DataFrame
car_sal_miss_df

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

Notice the missing values are represented as `NaN` in pandas DataFrames.

Let's try fill them.

In [42]:
# Fill the Odometer column missing values with the mean of the column inplace
car_sal_miss_df.Odometer.fillna(car_sal_miss_df.Odometer.mean(),inplace = True)

In [43]:
# View the car sales missing DataFrame and verify the changes
car_sal_miss_df

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500
6   Honda    NaN   92302.666667    4.0   $7,500
7   Honda   Blue   92302.666667    4.0      NaN
8  Toyota  White   60000.000000    NaN      NaN
9     NaN  White   31600.000000    4.0   $9,700

In [46]:
# Remove the rest of the missing data inplace
car_sal_miss_df.dropna(inplace = True)

In [48]:
# Verify the missing values are removed by viewing the DataFrame
car_sal_miss_df

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500

We'll now start to add columns to our DataFrame.

In [51]:
# Create a "Seats" column where every row has a value of 5
car_sal_miss_df['Seat'] = pd.Series([5]*6)

In [52]:
# Create a column called "Engine Size" with random values between 1.3 and 4.5
# Remember: If you're doing it from a Python list, the list has to be the same length
# as the DataFrame
car_sal_miss_df

     Make Colour       Odometer  Doors    Price  Seat
0  Toyota  White  150043.000000    4.0   $4,000     5
1   Honda    Red   87899.000000    4.0   $5,000     5
2  Toyota   Blue   92302.666667    3.0   $7,000     5
3     BMW  Black   11179.000000    5.0  $22,000     5
4  Nissan  White  213095.000000    4.0   $3,500     5
5  Toyota  Green   92302.666667    4.0   $4,500     5

In [54]:
# Create a column which represents the price of a car per kilometer
# Then view the DataFrame
car_sal_miss_df['price per km'] = (car_sal_miss_df.Price.replace(('\$','\,'),'',regex=True).astype(int))/car_sal_miss_df.Odometer

In [55]:
# Remove the last column you added using .drop()
car_sal_miss_df

     Make Colour       Odometer  Doors    Price  Seat  price per km
0  Toyota  White  150043.000000    4.0   $4,000     5      0.026659
1   Honda    Red   87899.000000    4.0   $5,000     5      0.056883
2  Toyota   Blue   92302.666667    3.0   $7,000     5      0.075837
3     BMW  Black   11179.000000    5.0  $22,000     5      1.967976
4  Nissan  White  213095.000000    4.0   $3,500     5      0.016425
5  Toyota  Green   92302.666667    4.0   $4,500     5      0.048753

In [64]:
# Shuffle the DataFrame using sample() with the frac parameter set to 1
# Save the the shuffled DataFrame to a new variable
car_sal_miss_df = car_sal_miss_df.sample(frac = 1)

Notice how the index numbers get moved around. The [`sample()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sample.html) function is a great way to get random samples from your DataFrame. It's also another great way to shuffle the rows by setting `frac=1`.

In [77]:
# Reset the indexes of the shuffled DataFrame
car_sal_miss_df = car_sal_miss_df.reset_index().drop('level_0',axis = 1)

Notice the index numbers have been changed to have order (start from 0).

In [79]:
# Change the Odometer values from kilometers to miles using a Lambda function
# Then view the DataFrame
car_sal_miss_df = car_sal_miss_df.drop('index', axis = 1)

In [90]:
# Change the title of the Odometer (KM) to represent miles instead of kilometers
car_sal_miss_df.Odometer = car_sal_miss_df.Odometer.apply(lambda x : x / 1.6)
car_sal_miss_df

     Make Colour    Odometer  Doors    Price
0  Toyota  White   93776.875    4.0   $4,000
1   Honda    Red   54936.875    4.0   $5,000
2  Toyota   Blue         NaN    3.0   $7,000
3     BMW  Black    6986.875    5.0  $22,000
4  Nissan  White  133184.375    4.0   $3,500
5  Toyota  Green         NaN    4.0   $4,500
6   Honda    NaN         NaN    4.0   $7,500
7   Honda   Blue         NaN    4.0      NaN
8  Toyota  White   37500.000    NaN      NaN
9     NaN  White   19750.000    4.0   $9,700

## Extensions

For more exercises, check out the pandas documentation, particularly the [10-minutes to pandas section](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html). 

One great exercise would be to retype out the entire section into a Jupyter Notebook of your own.

Get hands-on with the code and see what it does.

The next place you should check out are the [top questions and answers on Stack Overflow for pandas](https://stackoverflow.com/questions/tagged/pandas?sort=MostVotes&edited=true). Often, these contain some of the most useful and common pandas functions. Be sure to play around with the different filters!

Finally, always remember, the best way to learn something new to is try it. Make mistakes. Ask questions, get things wrong, take note of the things you do most often. And don't worry if you keep making the same mistake, pandas has many ways to do the same thing and is a big library. So it'll likely take a while before you get the hang of it.